{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove caffeine.xyz/caffeine.ai references from UI and docs",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Remove caffeine attribution/link from the public footer and ensure no other user-facing caffeine domain references remain.",
      "acceptanceCriteria": [
        "The footer no longer contains any link or text referencing caffeine.ai, caffeine.xyz, or caffine.xyz.",
        "The footer shows an English copyright line (e.g., \"© <current year> Subrin Kitab Pasal. All rights reserved.\").",
        "No other user-facing UI text contains caffeine.ai/caffeine.xyz/caffine.xyz."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace the footer attribution block that links to caffeine.ai (including UTM parameters) with a simple English copyright line using the current year (e.g., \"© {new Date().getFullYear()} Subrin Kitab Pasal. All rights reserved.\"). Also audit this file for any other occurrences of caffeine.ai/caffeine.xyz/caffine.xyz in user-facing text and remove/replace them."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Remove/replace caffeine.xyz/caffine.xyz references in repository documentation and configuration examples with a neutral placeholder domain.",
      "acceptanceCriteria": [
        "Repository docs/config examples contain no occurrences of \"caffeine.xyz\" or \"caffine.xyz\".",
        "If domain examples are needed in docs, they use a neutral placeholder (e.g., example.com) and remain in English."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Audit this deployment/custom-domain guide for any mentions of \"caffeine.xyz\" or \"caffine.xyz\" (including in example URLs/domains) and remove or replace them with a neutral placeholder domain such as \"example.com\", without changing the underlying custom-domain guidance beyond that."
        },
        {
          "path": "frontend/ANALYTICS.md",
          "operation": "modify",
          "description": "Audit this analytics documentation for any mentions of \"caffeine.xyz\" or \"caffine.xyz\" (including in any sample URLs or configuration examples) and remove or replace them with a neutral placeholder domain such as \"example.com\", keeping all examples and text in English."
        }
      ]
    }
  ]
}